---
type: ExternalResourceLoadData
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# ExternalResourceLoadData

`Autodesk.Revit.DB.ExternalResourceLoadData` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetExternalResourceReference | 2015 | `public ExternalResourceReference GetExternalResourceReference ()` |
| Method | GetLoadContent | 2015 | `public ExternalResourceLoadContent GetLoadContent ()` |
| Method | GetLoadContext | 2015 | `public ExternalResourceLoadContext GetLoadContext ()` |
| Method | GetLoadRequestId | 2015 | `public Guid GetLoadRequestId ()` |
| Property | ErrorsReported | 2015 | `public bool ErrorsReported { get ; set ; }` |
| Property | ExternalResourceType | 2015 | `public ExternalResourceType ExternalResourceType { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LoadStatus | 2015 | `public ExternalResourceLoadStatus LoadStatus { get ; }` |